// Auto-generated: calc-facing-shelter.js
// 2026-03-10T14:33:10.062Z
// 以下をports-data.jsのWAKAYAMA_PORTS等の配列に追加

const NEW_SPOTS = [
  ["南港大橋下",34.6670632,135.5333073,"osaka","大阪","","port",null,null,null,185,0.4],
  ["常吉大橋下",34.7368501,135.560202,"osaka","大阪","","pier",null,null,null,281,0],
  ["夢舞大橋下",34.6611385,135.3995733,"osaka","大阪","","pier",null,null,null,191,0.42],
  ["海とのふれあい広場",34.601918,135.4283902,"osaka","大阪","","pier",null,null,null,19,0.75],
  ["花市場前",34.6867167,135.1945794,"osaka","大阪","","pier",null,null,null,247,0.08],
  ["なぎさ公園",34.5100034,135.4049064,"osaka","大阪","","park",null,null,null,301,0.4],
  ["大津川尻",34.2677167,135.310292,"osaka","大阪","","river",null,null,null,318,0.3],
  ["大津川水銀灯",34.51,135.405,"osaka","大阪","","pier",null,null,null,301,0],
  ["ホクシン前",34.490243,135.3703426,"osaka","大阪","","pier",null,null,null,278,0.75],
  ["阪南港木材整理場",34.4833037,135.3725774,"osaka","大阪","","port",null,null,null,11,0.92],
  ["深日港",34.3173615,135.1415804,"osaka","大阪","","port",null,null,null,339,0.4],
  ["みさき公園裏",34.3324717,135.1654553,"osaka","大阪","","park",null,null,null,318,0.5],
  ["泉大津人工島",34.524235,135.3980468,"osaka","大阪","","pier",null,null,null,301,0],
  ["泉佐野・前島（旧フェリー乗り場）",34.4130619,135.3040581,"osaka","大阪","","pier",null,null,null,313,0.17],
  ["海釣ポート田尻",34.4003049,135.2887368,"osaka","大阪","","pier",null,null,null,224,0.58],
  ["尾崎漁港",34.3622095,135.2429496,"osaka","大阪","","port",null,null,null,326,0.4],
  ["観音崎・谷川港",34.3194951,135.1228984,"osaka","大阪","","port",null,null,null,340,0.4],
  ["汐見公園",34.509345,135.382281,"osaka","大阪","","park",null,null,null,223,0.4],
  ["せんなん里海公園",34.3393218,135.2080013,"osaka","大阪","","park",null,null,null,306,0.4],
];
